ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32F7/STM32Cube_FW/stm32f7xx_hal_conf.h
#if !defined  (USE_HAL_DMA2D_REGISTER_CALLBACKS)
  #define USE_HAL_DMA2D_REGISTER_CALLBACKS       0U /* DMA2D register callback disabled     */
#endif

#if !defined  (USE_HAL_DSI_REGISTER_CALLBACKS)
  #define USE_HAL_DSI_REGISTER_CALLBACKS         0U /* DSI register callback disabled       */
#endif

#if !defined  (USE_HAL_ETH_REGISTER_CALLBACKS)
  #define USE_HAL_ETH_REGISTER_CALLBACKS         0U /* ETH register callback disabled       */
#endif

#if !defined  (USE_HAL_HASH_REGISTER_CALLBACKS)
  #define USE_HAL_HASH_REGISTER_CALLBACKS        0U /* HASH register callback disabled      */
#endif

#if !defined  (USE_HAL_HCD_REGISTER_CALLBACKS)
  #define USE_HAL_HCD_REGISTER_CALLBACKS         0U /* HCD register callback disabled       */
#endif

#if !defined  (USE_HAL_I2C_REGISTER_CALLBACKS)
  #define USE_HAL_I2C_REGISTER_CALLBACKS         0U /* I2C register callback disabled       */
#endif

#if !defined  (USE_HAL_I2S_REGISTER_CALLBACKS)
  #define USE_HAL_I2S_REGISTER_CALLBACKS         0U /* I2S register callback disabled       */
#endif

#if !defined  (USE_HAL_IRDA_REGISTER_CALLBACKS)
  #define USE_HAL_IRDA_REGISTER_CALLBACKS        0U /* IRDA register callback disabled      */
#endif

#if !defined  (USE_HAL_JPEG_REGISTER_CALLBACKS)
  #define USE_HAL_JPEG_REGISTER_CALLBACKS        0U /* JPEG register callback disabled      */
#endif

#if !defined  (USE_HAL_LPTIM_REGISTER_CALLBACKS)
  #define USE_HAL_LPTIM_REGISTER_CALLBACKS       0U /* LPTIM register callback disabled     */
#endif

#if !defined  (USE_HAL_LTDC_REGISTER_CALLBACKS)
  #define USE_HAL_LTDC_REGISTER_CALLBACKS        0U /* LTDC register callback disabled      */
#endif

#if !defined  (USE_HAL_MDIOS_REGISTER_CALLBACKS)
  #define USE_HAL_MDIOS_REGISTER_CALLBACKS       0U /* MDIOS register callback disabled     */
#endif

#if !defined  (USE_HAL_MMC_REGISTER_CALLBACKS)
  #define USE_HAL_MMC_REGISTER_CALLBACKS         0U /* MMC register callback disabled       */
#endif

#if !defined  (USE_HAL_NAND_REGISTER_CALLBACKS)
  #define USE_HAL_NAND_REGISTER_CALLBACKS        0U /* NAND register callback disabled      */
#endif

#if !defined  (USE_HAL_NOR_REGISTER_CALLBACKS)
  #define USE_HAL_NOR_REGISTER_CALLBACKS         0U /* NOR register callback disabled       */
#endif

#if !defined  (USE_HAL_PCD_REGISTER_CALLBACKS)
  #define USE_HAL_PCD_REGISTER_CALLBACKS         0U /* PCD register callback disabled       */
#endif

#if !defined  (USE_HAL_QSPI_REGISTER_CALLBACKS)
  #define USE_HAL_QSPI_REGISTER_CALLBACKS        0U /* QSPI register callback disabled      */
#endif

#if !defined  (USE_HAL_RNG_REGISTER_CALLBACKS)
  #define USE_HAL_RNG_REGISTER_CALLBACKS         0U /* RNG register callback disabled       */
#endif

#if !defined  (USE_HAL_RTC_REGISTER_CALLBACKS)
  #define USE_HAL_RTC_REGISTER_CALLBACKS         0U /* RTC register callback disabled       */
#endif

#if !defined  (USE_HAL_SAI_REGISTER_CALLBACKS)
  #define USE_HAL_SAI_REGISTER_CALLBACKS         0U /* SAI register callback disabled       */
#endif

#if !defined  (USE_HAL_SD_REGISTER_CALLBACKS)
  #define USE_HAL_SD_REGISTER_CALLBACKS          0U /* SD register callback disabled        */
#endif

#if !defined  (USE_HAL_SMARTCARD_REGISTER_CALLBACKS)
  #define USE_HAL_SMARTCARD_REGISTER_CALLBACKS   0U /* SMARTCARD register callback disabled */
#endif

#if !defined  (USE_HAL_SDRAM_REGISTER_CALLBACKS)
  #define USE_HAL_SDRAM_REGISTER_CALLBACKS       0U /* SDRAM register callback disabled     */
#endif

#if !defined  (USE_HAL_SRAM_REGISTER_CALLBACKS)
  #define USE_HAL_SRAM_REGISTER_CALLBACKS        0U /* SRAM register callback disabled      */
#endif

#if !defined  (USE_HAL_SPDIFRX_REGISTER_CALLBACKS)
  #define USE_HAL_SPDIFRX_REGISTER_CALLBACKS     0U /* SPDIFRX register callback disabled   */
#endif

#if !defined  (USE_HAL_SMBUS_REGISTER_CALLBACKS)
  #define USE_HAL_SMBUS_REGISTER_CALLBACKS       0U /* SMBUS register callback disabled     */
#endif

#if !defined  (USE_HAL_SPI_REGISTER_CALLBACKS)
  #define USE_HAL_SPI_REGISTER_CALLBACKS         0U /* SPI register callback disabled       */
#endif

#if !defined  (USE_HAL_TIM_REGISTER_CALLBACKS)
  #define USE_HAL_TIM_REGISTER_CALLBACKS         0U /* TIM register callback disabled       */
#endif

#if !defined  (USE_HAL_UART_REGISTER_CALLBACKS)
  #define USE_HAL_UART_REGISTER_CALLBACKS        0U /* UART register callback disabled      */
#endif

#if !defined  (USE_HAL_USART_REGISTER_CALLBACKS)
  #define USE_HAL_USART_REGISTER_CALLBACKS       0U /* USART register callback disabled     */
#endif

#if !defined  (USE_HAL_WWDG_REGISTER_CALLBACKS)
  #define USE_HAL_WWDG_REGISTER_CALLBACKS        0U /* WWDG register callback disabled      */
#endif

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1 */

/* ################## Ethernet peripheral configuration ##################### */

/* Section 1 : Ethernet peripheral configuration */

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0   2U
#define MAC_ADDR1   0U
#define MAC_ADDR2   0U
#define MAC_ADDR3   0U
#define MAC_ADDR4   0U
#define MAC_ADDR5   0U

#ifdef MBED_CONF_STM32_EMAC_ETH_RXBUFNB
/* default value in connectivity/drivers/emac/TARGET_STM/mbed_lib.json */
#define ETH_RXBUFNB                    MBED_CONF_STM32_EMAC_ETH_RXBUFNB  /* Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB                    MBED_CONF_STM32_EMAC_ETH_TXBUFNB  /* Tx buffers of size ETH_TX_BUF_SIZE  */
#else
/* ex: bare metal profile */
#define ETH_RXBUFNB                    0  /* Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB                    0  /* Tx buffers of size ETH_TX_BUF_SIZE  */
#endif

/* Section 2: PHY configuration section */

/* DP83848 PHY Address*/ 
#define DP83848_PHY_ADDRESS             0x01U
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/ 
/* PHY delay */
#ifdef MBED_CONF_STM32_EMAC_ETH_PHY_RESET_DELAY
#define PHY_RESET_DELAY                 MBED_CONF_STM32_EMAC_ETH_PHY_RESET_DELAY
#else
#define PHY_RESET_DELAY                 0
#endif
/* PHY Configuration delay */
#define PHY_CONFIG_DELAY                0x00000FFFU
#define PHY_READ_TO                     0x0000FFFFU
#define PHY_WRITE_TO                    0x0000FFFFU

/* Section 3: Common PHY Registers */

#define PHY_BCR                         ((uint16_t)0x00U)    /*!< Transceiver Basic Control Register   */
#define PHY_BSR                         ((uint16_t)0x01U)    /*!< Transceiver Basic Status Register    */
 
#define PHY_RESET                       ((uint16_t)0x8000U)  /*!< PHY Reset */
#define PHY_LOOPBACK                    ((uint16_t)0x4000U)  /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100U)  /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000U)  /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100U)  /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000U)  /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION             ((uint16_t)0x1000U)  /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION     ((uint16_t)0x0200U)  /*!< Restart auto-negotiation function    */
#define PHY_POWERDOWN                   ((uint16_t)0x0800U)  /*!< Select the power down mode           */
#define PHY_ISOLATE                     ((uint16_t)0x0400U)  /*!< Isolate PHY from MII                 */

#define PHY_AUTONEGO_COMPLETE           ((uint16_t)0x0020U)  /*!< Auto-Negotiation process completed   */
#define PHY_LINKED_STATUS               ((uint16_t)0x0004U)  /*!< Valid link established               */
#define PHY_JABBER_DETECTION            ((uint16_t)0x0002U)  /*!< Jabber condition detected            */
  
/* Section 4: Extended PHY Registers */

/* Section 4: Extended PHY Registers */
#ifdef MBED_CONF_STM32_EMAC_ETH_PHY_STATUS_REGISTER
#define PHY_SR                          MBED_CONF_STM32_EMAC_ETH_PHY_STATUS_REGISTER  /*!< PHY status register Offset                      */
#define PHY_SPEED_STATUS                MBED_CONF_STM32_EMAC_ETH_PHY_SPEED_STATUS     /*!< PHY Speed mask                                  */
#define PHY_DUPLEX_STATUS               MBED_CONF_STM32_EMAC_ETH_PHY_DUPLEX_STATUS    /*!< PHY Duplex mask                                 */
#else
#define PHY_SR                          ((uint16_t)0x10U)    /*!< PHY status register Offset                      */
#define PHY_SPEED_STATUS                ((uint16_t)0x0002U)  /*!< PHY Speed mask                                  */
#define PHY_DUPLEX_STATUS               ((uint16_t)0x0004U)  /*!< PHY Duplex mask                                 */
#endif


#define PHY_MICR                        ((uint16_t)0x11U)    /*!< MII Interrupt Control Register                  */
#define PHY_MISR                        ((uint16_t)0x12U)    /*!< MII Interrupt Status and Misc. Control Register */
 
#define PHY_LINK_STATUS                 ((uint16_t)0x0001U)  /*!< PHY Link mask                                   */

